In [3]:
#!pip install ipython-sql
#!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /home/xl/projects/data_engineering/.venv/lib/python3.8/site-packages (1.4.41)
Requirement already satisfied: greenlet!=0.4.17 in /home/xl/projects/data_engineering/.venv/lib/python3.8/site-packages (from sqlalchemy) (1.1.3.post0)

<p>Here are some general-looking connection strings for various databases:</p>
<ul>
    <li>PostgreSQL: postgresql://username:password@server:port/db</li>
    <li>MySQL: mysql://scott:tiger@localhost/foo</li>
    <li>Oracle: oracle://scott:tiger@127.0.0.1:1521/sidname</li>
    <li>SQL Server: mssql+pyodbc://scott:tiger@mydsn</li>
    <li>SQLite: sqlite:///foo.db</li>
</ul>

In [5]:
import sqlalchemy
sqlalchemy.create_engine('postgresql://dbadmin:pw123@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/bpsimple')
#%load_ext sql
%reload_ext sql
%sql postgresql://dbadmin:pw123@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/bpsimple

In [6]:
%%sql 
SELECT * FROM customer;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/bpsimple
15 rows affected.

[(1, 'Miss', 'Jenny', 'Stones', '27 Rowan Avenue', 'Hightown', 'NT2 1AQ   ', '023 9876'),
 (2, 'Mr  ', 'Andrew', 'Stones', '52 The Willows', 'Lowtown', 'LT5 7RA   ', '876 3527'),
 (3, 'Miss', 'Alex', 'Matthew', '4 The Street', 'Nicetown', 'NT2 2TX   ', '010 4567'),
 (4, 'Mr  ', 'Adrian', 'Matthew', 'The Barn', 'Yuleville', 'YV67 2WR  ', '487 3871'),
 (5, 'Mr  ', 'Simon', 'Cozens', '7 Shady Lane', 'Oakenham', 'OA3 6QW   ', '514 5926'),
 (6, 'Mr  ', 'Neil', 'Matthew', '5 Pasture Lane', 'Nicetown', 'NT3 7RT   ', '267 1232'),
 (7, 'Mr  ', 'Richard', 'Stones', '34 Holly Way', 'Bingham', 'BG4 2WE   ', '342 5982'),
 (8, 'Mrs ', 'Ann', 'Stones', '34 Holly Way', 'Bingham', 'BG4 2WE   ', '342 5982'),
 (9, 'Mrs ', 'Christine', 'Hickman', '36 Queen Street', 'Histon', 'HT3 5EM   ', '342 5432'),
 (10, 'Mr  ', 'Mike', 'Howard', '86 Dysart Street', 'Tibsville', 'TB3 7FG   ', '505 5482'),
 (11, 'Mr  ', 'Dave', 'Jones', '54 Vale Rise', 'Bingham', 'BG3 8GD   ', '342 8264'),
 (12, 'Mr  ', 'Richard', 'Neill', '42 Thatched Way', 'Winersby', 'WB3 6GQ   ', '505 6482'),
 (13, 'Mrs ', 'Laura', 'Hardy', '73 Margarita Way', 'Oxbridge', 'OX2 3HX   ', '821 2335'),
 (14, 'Mr  ', 'Bill', "O'Neill", '2 Beamer Street', 'Welltown', 'WT3 8GM   ', '435 1234'),
 (15, 'Mr  ', 'David', 'Hudson', '4 The Square', 'Milltown', 'MT2 6RT   ', '961 4526')]

<h3>Converting to Pandas DataFrame</h3>

In [7]:
import pandas as pd
query_result = %sql SELECT * FROM item WHERE description LIKE 'Linux CD'
df = pd.DataFrame(query_result)
print(type(df))
df

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/bpsimple
1 rows affected.
<class 'pandas.core.frame.DataFrame'>

   item_id description cost_price sell_price
0        3    Linux CD       1.99       2.49